{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}eRegCom
       {txt}log:  {res}/Users/cjr/Repos/eReg-analysis-Lila/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Feb 2022, 17:18:43
{txt}
{com}. 
. // Set the random seed.
. set seed 1234
{txt}
{com}. 
. 
. // Set global macros.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Define a macro with the names of the frames.
. global frames attendance anemia hypertension gdm
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Prepare the data for analysis.
. quietly do data/outcomes
{txt}
{com}. 
. // Perform estimation.
. do estimation/estimate
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Specify the model, which is parameterized in terms of the outcome (y),
. // comparison, any additional fixed effects (fixed), and random effects (random).
. local fe    i.phase_n i.us i.lab clussize
{txt}
{com}. local vce   vce(cluster str_TRIAL_2_Cluster)
{txt}
{com}. local model melogit \`y' i.\`comparison' `fe' \`fixed' \`random', or `vce'
{txt}
{com}. 
. // Specify the comparisons.
. local comparisons   AB AC AD BC BD CD
{txt}
{com}. 
. // Specify the data frames and their outcomes.
. local attendance_outcomes   att
{txt}
{com}. local anemia_outcomes       success_anemia_ screen_anemia man_anemia
{txt}
{com}. local hypertension_outcomes success_htn_    screen_hyp
{txt}
{com}. local gdm_outcomes          success_gdm     screen_gdm
{txt}
{com}. 
. // Specify outcomes that do not require a random effect for uniqueid.
. local no_random man_anemia
{txt}
{com}. 
. // Specify *additional* fixed effects for certain outcomes.
. local man_anemia_fixed i.timepoint
{txt}
{com}. 
. // Run the analyses.
. foreach frame of global frames {c -(}
{txt}  2{com}.   frame `frame' {c -(}
{txt}  3{com}.     foreach y of local `frame'_outcomes {c -(}
{txt}  4{com}.       disp "{c -(}hline{c )-}"
{txt}  5{com}.       disp "{c -(}title:Analyzing `y' (`: data label'){c )-}" // Log the outcome.
{txt}  6{com}. 
.       // Get the additional fixed effects for this outcome, if there are any.
.       local fixed "" // Ensure that the macro is initially empty!
{txt}  7{com}.       local fixed ``y'_fixed'
{txt}  8{com}. 
.       // Specify the random effect variable for this outcome.
.       local random || uniqueid: // Model clustering within woman...
{txt}  9{com}.       if strpos("`no_random'", "`y'") local random "" // ... unless we should not.
{txt} 10{com}. 
.       foreach comparison of local comparisons {c -(}
{txt} 11{com}.         `model' // Run the analysis.
{txt} 12{com}.         assert e(converged)
{txt} 13{com}.         disp "The above estimates were produced using `e(cmdline)'"
{txt} 14{com}.         disp "{c -(}hline{c )-}"
{txt} 15{com}.       {c )-}
{txt} 16{com}.     {c )-}
{txt} 17{com}.   {c )-}
{txt} 18{com}. {c )-}
{hline}
{title:Analyzing att (Attendance)}
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-4998.9814}  
Iteration 1:{space 3}log likelihood = {res:-4987.5116}  
Iteration 2:{space 3}log likelihood = {res:-4987.4717}  
Iteration 3:{space 3}log likelihood = {res:-4987.4717}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-4841.4941}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-4841.4941}  
Iteration 1:{space 3}log pseudolikelihood = {res:-4760.5992}  
Iteration 2:{space 3}log pseudolikelihood = {res:-4754.2032}  
Iteration 3:{space 3}log pseudolikelihood = {res:-4754.0637}  
Iteration 4:{space 3}log pseudolikelihood = {res:-4754.0631}  
Iteration 5:{space 3}log pseudolikelihood = {res:-4754.0631}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}     8,879
{txt}Group variable: {col 24}{res}uniqueid{col 49}{txt}Number of groups{col 67}={res}{col 69}     5,190

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}         1
{col 63}{txt}avg{col 67}={res}{col 69}       1.7
{col 63}{txt}max{col 67}={res}{col 69}         4

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}6{txt}){col 67}={res}{col 70}    31.44
{txt}Log pseudolikelihood = {res}-4754.0631{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{ralign 78:(Std. Err. adjusted for {res:68} clusters in str_TRIAL_2_Cluster)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         att{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.AB {c |}{col 14}{res}{space 2} 4.209317{col 26}{space 2} 2.547807{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} 1.285281{col 67}{space 3} 13.78558
{txt}{space 12} {c |}
{space 5}phase_n {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 6.455749{col 26}{space 2} 5.366953{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} 1.265624{col 67}{space 3} 32.92976
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 19.12304{col 26}{space 2} 28.09954{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 54}{space 4} 1.073484{col 67}{space 3}  340.658
{txt}{space 12} {c |}
{space 10}us {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} .5641377{col 26}{space 2} .3408809{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4} .1726019{col 67}{space 3} 1.843846
{txt}{space 12} {c |}
{space 9}lab {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2}  2.42186{col 26}{space 2} 1.500473{col 37}{space 1}    1.43{col 46}{space 3}0.153{col 54}{space 4} .7190903{col 67}{space 3}   8.1567
{txt}{space 4}clussize {c |}{col 14}{res}{space 2} 1.009989{col 26}{space 2} .0624921{col 37}{space 1}    0.16{col 46}{space 3}0.872{col 54}{space 4} .8946419{col 67}{space 3} 1.140207
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0186069{col 26}{space 2} .0152254{col 37}{space 1}   -4.87{col 46}{space 3}0.000{col 54}{space 4} .0037425{col 67}{space 3} .0925088
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}uniqueid    {col 14}{txt}{c |}
{space 3}var(_cons){c |}{col 14}{res}{space 2}  3.34584{col 26}{space 2} .7860898{col 54}{space 4}  2.11115{col 67}{space 3} 5.302627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
The above estimates were produced using melogit att i.AB i.phase_n i.us i.lab clussize  || uniqueid:, or vce(cluster str_TRIAL_2_Cluster)
{hline}
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-4708.5577}  
Iteration 1:{space 3}log likelihood = {res:-4633.9578}  
Iteration 2:{space 3}log likelihood = {res:-4632.7653}  
Iteration 3:{space 3}log likelihood = {res:-4632.7649}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-4525.3682}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-4525.3682}  
Iteration 1:{space 3}log pseudolikelihood = {res:-4474.8567}  
Iteration 2:{space 3}log pseudolikelihood = {res:-4471.2705}  
Iteration 3:{space 3}log pseudolikelihood = {res:-4471.2688}  
Iteration 4:{space 3}log pseudolikelihood = {res:-4471.2688}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}     8,714
{txt}Group variable: {col 24}{res}uniqueid{col 49}{txt}Number of groups{col 67}={res}{col 69}     5,110

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}         1
{col 63}{txt}avg{col 67}={res}{col 69}       1.7
{col 63}{txt}max{col 67}={res}{col 69}         4

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}6{txt}){col 67}={res}{col 70}    31.42
{txt}Log pseudolikelihood = {res}-4471.2688{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{ralign 78:(Std. Err. adjusted for {res:67} clusters in str_TRIAL_2_Cluster)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         att{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.AC {c |}{col 14}{res}{space 2} 2.169584{col 26}{space 2} 1.113628{col 37}{space 1}    1.51{col 46}{space 3}0.131{col 54}{space 4}  .793345{col 67}{space 3} 5.933223
{txt}{space 12} {c |}
{space 5}phase_n {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 2.261003{col 26}{space 2} 1.423527{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4} .6582413{col 67}{space 3} 7.766356
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 13.68909{col 26}{space 2} 15.51978{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} 1.483675{col 67}{space 3}  126.302
{txt}{space 12} {c |}
{space 10}us {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} 1.148803{col 26}{space 2} .7033481{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}  .346021{col 67}{space 3} 3.814072
{txt}{space 12} {c |}
{space 9}lab {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} 4.026342{col 26}{space 2} 2.427185{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} 1.235333{col 67}{space 3} 13.12312
{txt}{space 4}clussize {c |}{col 14}{res}{space 2} .7380887{col 26}{space 2} .0649034{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4} .6212389{col 67}{space 3} .8769169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0643172{col 26}{space 2}  .051032{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4} .0135815{col 67}{space 3} .3045841
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}uniqueid    {col 14}{txt}{c |}
{space 3}var(_cons){c |}{col 14}{res}{space 2} 2.616711{col 26}{space 2} .6504521{col 54}{space 4}  1.60756{col 67}{space 3} 4.259359
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
The above estimates were produced using melogit att i.AC i.phase_n i.us i.lab clussize  || uniqueid:, or vce(cluster str_TRIAL_2_Cluster)
{hline}
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-3872.8748}  
Iteration 1:{space 3}log likelihood = {res:-3774.2965}  
Iteration 2:{space 3}log likelihood = {res:-3769.5708}  
Iteration 3:{space 3}log likelihood = {res:-3769.5489}  
Iteration 4:{space 3}log likelihood = {res:-3769.5489}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-3672.6129}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3672.6129}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3623.0127}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3619.1173}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3619.0132}  
Iteration 4:{space 3}log pseudolikelihood = {res:-3619.0119}  
Iteration 5:{space 3}log pseudolikelihood = {res:-3619.0119}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}     7,766
{txt}Group variable: {col 24}{res}uniqueid{col 49}{txt}Number of groups{col 67}={res}{col 69}     4,561

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}         1
{col 63}{txt}avg{col 67}={res}{col 69}       1.7
{col 63}{txt}max{col 67}={res}{col 69}         4

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}6{txt}){col 67}={res}{col 70}    62.88
{txt}Log pseudolikelihood = {res}-3619.0119{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{ralign 78:(Std. Err. adjusted for {res:67} clusters in str_TRIAL_2_Cluster)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         att{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}1.AD {c |}{col 14}{res}{space 2} 1.312172{col 26}{space 2} .7304827{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4} .4406858{col 67}{space 3} 3.907081
{txt}{space 12} {c |}
{space 5}phase_n {c |}
{space 10}2  {c |}{col 14}{res}{space 2} 73.61201{col 26}{space 2} 71.84411{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4} 10.86901{col 67}{space 3} 498.5485
{txt}{space 10}3  {c |}{col 14}{res}{space 2} 9.244022{col 26}{space 2} 16.82856{col 37}{space 1}    1.22{col 46}{space 3}0.222{col 54}{space 4} .2607747{col 67}{space 3} 327.6849
{txt}{space 12} {c |}
{space 10}us {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} .5610325{col 26}{space 2} .6873108{col 37}{space 1}   -0.47{col 46}{space 3}0.637{col 54}{space 4} .0508389{col 67}{space 3} 6.191269
{txt}{space 12} {c |}
{space 9}lab {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} 2.615847{col 26}{space 2} 1.553292{col 37}{space 1}    1.62{col 46}{space 3}0.105{col 54}{space 4} .8168992{col 67}{space 3}  8.37638
{txt}{space 4}clussize {c |}{col 14}{res}{space 2} 1.088247{col 26}{space 2} .1332602{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4} .8560407{col 67}{space 3}  1.38344
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0028273{col 26}{space 2} .0043217{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4} .0001413{col 67}{space 3} .0565554
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}uniqueid    {col 14}{txt}{c |}
{space 3}var(_cons){c |}{col 14}{res}{space 2} 3.083921{col 26}{space 2} 1.168314{col 54}{space 4} 1.467688{col 67}{space 3} 6.479966
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
The above estimates were produced using melogit att i.AD i.phase_n i.us i.lab clussize  || uniqueid:, or vce(cluster str_TRIAL_2_Cluster)
{hline}
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-6271.0284}  
Iteration 1:{space 3}log likelihood = {res:-6261.3598}  
Iteration 2:{space 3}log likelihood = {res:-6261.3555}  
Iteration 3:{space 3}log likelihood = {res:-6261.3555}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-6040.7879}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-6040.7879}  
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file
{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. 